In [1]:
import pandas as pd
import numpy as np

In [2]:
cs2023 = pd.read_csv(r"F:\Office work\Data Analytics\Self study Data analytics full course\Other Data CSV\SQL\sql dataset\Car_Showroom_2023.csv")
cs2024 = pd.read_csv(r"F:\Office work\Data Analytics\Self study Data analytics full course\Other Data CSV\SQL\sql dataset\Car_Showroom_2024.csv")
cs2025 = pd.read_csv(r"F:\Office work\Data Analytics\Self study Data analytics full course\Other Data CSV\SQL\sql dataset\Car_Showroom_2025.csv")

In [3]:
cs2023.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
0,20001,100000,Baleno,CNG,Mumbai,3/10/2023,1539002,49
1,20002,100001,XUV300,Electric,Pune,8/19/2023,696837,32
2,20003,100002,Verna,Electric,Chennai,1/15/2023,504416,45
3,20004,100003,Venue,Diesel,Chennai,8/17/2023,714385,21
4,20005,100004,Swift,Petrol,Hyderabad,1/16/2023,1635424,1

In [4]:
cs2023.tail()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
9995,29996,109995,XUV300,Diesel,Delhi,3/22/2023,1503474,27
9996,29997,109996,Creta,Petrol,Pune,10/11/2023,1534148,27
9997,29998,109997,Creta,CNG,Mumbai,6/6/2023,1509087,24
9998,29999,109998,Verna,Petrol,Bangalore,7/13/2023,862715,24
9999,30000,109999,Venue,Electric,Mumbai,2/15/2023,1154672,44

In [5]:
cs2023.sample(5)

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
2773,22774,102773,City,CNG,Delhi,4/9/2023,542357,22
8734,28735,108734,Verna,Electric,Bangalore,7/8/2023,1575185,6
3578,23579,103578,XUV300,CNG,Mumbai,7/12/2023,1767352,30
4621,24622,104621,City,Petrol,Mumbai,9/3/2023,530604,40
1558,21559,101558,City,Petrol,Delhi,12/31/2023,1471261,33

In [6]:
cs2023.describe()

            SaleID    CustomerID         Price  SalesPersonID
count  10000.00000   10000.00000  1.000000e+04   10000.000000
mean   25000.50000  104999.50000  1.152304e+06      25.308900
std     2886.89568    2886.89568  3.731853e+05      14.365275
min    20001.00000  100000.00000  5.001080e+05       1.000000
25%    22500.75000  102499.75000  8.290552e+05      13.000000
50%    25000.50000  104999.50000  1.156438e+06      25.000000
75%    27500.25000  107499.25000  1.478092e+06      38.000000
max    30000.00000  109999.00000  1.799939e+06      50.000000

In [7]:
cs2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         10000 non-null  int64
 1   CustomerID     10000 non-null  int64
 2   CarModel       10000 non-null  object
 3   FuelType       10000 non-null  object
 4   City           10000 non-null  object
 5   SaleDate       10000 non-null  object
 6   Price          10000 non-null  int64
 7   SalesPersonID  10000 non-null  int64
dtypes: int64(4), object(4)
memory usage: 625.1+ KB

In [8]:
cs2023[cs2023.duplicated()]

Empty DataFrame
Columns: [SaleID, CustomerID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID]
Index: []

In [9]:
cs2023.isna().sum()

SaleID           0
CustomerID       0
CarModel         0
FuelType         0
City             0
SaleDate         0
Price            0
SalesPersonID    0
dtype: int64

In [10]:
cs2023['SaleDate'] = pd.to_datetime(cs2023['SaleDate'])

In [11]:
cs2023['Year'] = cs2023['SaleDate'].dt.strftime('%Y')

In [12]:
cs2023['SaleID'] = cs2023['SaleID'].astype(object)
cs2023['CustomerID'] = cs2023['CustomerID'].astype(object)

In [13]:
cs2023.describe()

                         SaleDate         Price  SalesPersonID
count                       10000  1.000000e+04   10000.000000
mean   2023-06-30 21:01:43.680000  1.152304e+06      25.308900
min           2023-01-01 00:00:00  5.001080e+05       1.000000
25%           2023-04-01 00:00:00  8.290552e+05      13.000000
50%           2023-06-30 00:00:00  1.156438e+06      25.000000
75%           2023-09-30 00:00:00  1.478092e+06      38.000000
max           2023-12-31 00:00:00  1.799939e+06      50.000000
std                           NaN  3.731853e+05      14.365275

In [14]:
cs2023.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         10000 non-null  object
 1   CustomerID     10000 non-null  object
 2   CarModel       10000 non-null  object
 3   FuelType       10000 non-null  object
 4   City           10000 non-null  object
 5   SaleDate       10000 non-null  datetime64[ns]
 6   Price          10000 non-null  int64
 7   SalesPersonID  10000 non-null  int64
 8   Year           10000 non-null  object
dtypes: datetime64[ns](1), int64(2), object(6)
memory usage: 703.3+ KB

In [15]:
# =========================================================================================

In [16]:
cs2024.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
0,20001,100000,i20,Electric,Hyderabad,9/4/2024,881926,50
1,20002,100001,Swift,Electric,Chennai,3/19/2024,1763364,15
2,20003,100002,Verna,Diesel,Hyderabad,11/1/2024,859163,10
3,20004,100003,City,CNG,Bangalore,2/5/2024,1578002,21
4,20005,100004,i20,Petrol,Hyderabad,12/14/2024,836295,28

In [17]:
cs2024.tail()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
9995,29996,109995,XUV300,CNG,Delhi,7/26/2024,1223399,37
9996,29997,109996,Verna,Diesel,Delhi,3/3/2024,1296121,3
9997,29998,109997,XUV300,CNG,Hyderabad,12/21/2024,1016770,18
9998,29999,109998,City,CNG,Pune,12/5/2024,1298753,19
9999,30000,109999,XUV300,Electric,Hyderabad,7/18/2024,790623,43

In [18]:
cs2024.sample(5)

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
4298,24299,104298,XUV300,Electric,Pune,1/10/2024,1624325,29
4772,24773,104772,Baleno,Petrol,Chennai,1/4/2024,1251342,32
6483,26484,106483,Verna,Diesel,Chennai,4/3/2024,992517,32
1873,21874,101873,Venue,CNG,Pune,3/12/2024,1049406,3
2368,22369,102368,City,Electric,Mumbai,8/18/2024,701312,11

In [19]:
cs2024.describe()

            SaleID    CustomerID         Price  SalesPersonID
count  10000.00000   10000.00000  1.000000e+04   10000.000000
mean   25000.50000  104999.50000  1.151089e+06      25.584000
std     2886.89568    2886.89568  3.746446e+05      14.345575
min    20001.00000  100000.00000  5.000380e+05       1.000000
25%    22500.75000  102499.75000  8.291175e+05      13.000000
50%    25000.50000  104999.50000  1.151456e+06      26.000000
75%    27500.25000  107499.25000  1.475308e+06      38.000000
max    30000.00000  109999.00000  1.799971e+06      50.000000

In [20]:
cs2024.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         10000 non-null  int64
 1   CustomerID     10000 non-null  int64
 2   CarModel       10000 non-null  object
 3   FuelType       10000 non-null  object
 4   City           10000 non-null  object
 5   SaleDate       10000 non-null  object
 6   Price          10000 non-null  int64
 7   SalesPersonID  10000 non-null  int64
dtypes: int64(4), object(4)
memory usage: 625.1+ KB

In [21]:
cs2024[cs2024.duplicated()]

Empty DataFrame
Columns: [SaleID, CustomerID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID]
Index: []

In [22]:
cs2024.isna().sum()

SaleID           0
CustomerID       0
CarModel         0
FuelType         0
City             0
SaleDate         0
Price            0
SalesPersonID    0
dtype: int64

In [23]:
cs2024['SaleDate'] = pd.to_datetime(cs2024['SaleDate'])

In [24]:
cs2024['SaleYear'] = cs2024['SaleDate'].dt.strftime('%Y')

In [25]:
cs2024.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         10000 non-null  int64
 1   CustomerID     10000 non-null  int64
 2   CarModel       10000 non-null  object
 3   FuelType       10000 non-null  object
 4   City           10000 non-null  object
 5   SaleDate       10000 non-null  datetime64[ns]
 6   Price          10000 non-null  int64
 7   SalesPersonID  10000 non-null  int64
 8   SaleYear       10000 non-null  object
dtypes: datetime64[ns](1), int64(4), object(4)
memory usage: 703.3+ KB

In [26]:
cs2024['SaleID'] = cs2024['SaleID'].astype(object)
cs2024['CustomerID'] = cs2024['CustomerID'].astype(object)

In [27]:
cs2024.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         10000 non-null  object
 1   CustomerID     10000 non-null  object
 2   CarModel       10000 non-null  object
 3   FuelType       10000 non-null  object
 4   City           10000 non-null  object
 5   SaleDate       10000 non-null  datetime64[ns]
 6   Price          10000 non-null  int64
 7   SalesPersonID  10000 non-null  int64
 8   SaleYear       10000 non-null  object
dtypes: datetime64[ns](1), int64(2), object(6)
memory usage: 703.3+ KB

In [28]:
# ==================================================================================================================

In [29]:
cs2025.head()

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
0,40001.0,100000.0,Creta,Diesel,Bangalore,4/28/2025,1578732,25.0,NaN
1,40002.0,100001.0,i20,Diesel,Delhi,9/19/2025,1246909,5.0,NaN
2,40003.0,100002.0,Baleno,Electric,Pune,5/28/2025,1490661,12.0,NaN
3,40004.0,100003.0,Verna,Petrol,Hyderabad,9/5/2025,"$887,475",20.0,NaN
4,40005.0,100004.0,City,Electric,Bangalore,9/6/2025,"$1,595,008",16.0,NaN

In [30]:
cs2025.tail()

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
10000,49996.0,109995.0,Baleno,Petrol,Hyderabad,5/29/2025,636446,25.0,NaN
10001,49997.0,109996.0,Swift,Electric,Mumbai,5/8/2025,0,15.0,NaN
10002,49998.0,109997.0,XUV300,CNG,Bangalore,5/21/2025,1458266,44.0,NaN
10003,49999.0,109998.0,City,CNG,Pune,6/8/2025,0,32.0,NaN
10004,50000.0,109999.0,i20,Petrol,Pune,3/17/2025,531778,46.0,NaN

In [31]:
cs2025.sample(5)

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
9571,49568.0,109567.0,Creta,Petrol,Chennai,7/13/2025,1698054,35.0,NaN
7569,47566.0,107565.0,Creta,Diesel,Delhi,2/11/2025,665626,7.0,NaN
8384,48381.0,108380.0,Venue,Diesel,Hyderabad,10/22/2025,939836,35.0,NaN
2974,42971.0,102970.0,Venue,Petrol,Pune,7/4/2025,1693356,50.0,NaN
9382,49379.0,109378.0,Creta,Petrol,Mumbai,9/3/2025,1314665,45.0,NaN

In [32]:
cs2025.describe()

            Sale ID    Customer ID  SalesPersonID  abc
count  10002.000000   10001.000000   10001.000000  0.0
mean   44999.508298  104998.009699      25.561044  NaN
std     2887.458723    2887.172468      14.460411  NaN
min    40001.000000  100000.000000       1.000000  NaN
25%    42499.250000  102498.000000      13.000000  NaN
50%    44999.500000  104998.000000      26.000000  NaN
75%    47499.750000  107498.000000      38.000000  NaN
max    50000.000000  109999.000000      50.000000  NaN

In [33]:
cs2025.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10005 entries, 0 to 10004
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sale ID        10002 non-null  float64
 1   Customer ID    10001 non-null  float64
 2   CarModel       10001 non-null  object
 3   FuelType       10001 non-null  object
 4   City           10001 non-null  object
 5   SaleDate       9999 non-null   object
 6   Price          10001 non-null  object
 7   SalesPersonID  10001 non-null  float64
 8   abc            0 non-null      float64
dtypes: float64(4), object(5)
memory usage: 703.6+ KB

In [34]:
cs2025[cs2025.duplicated()]

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
18,40018.0,100017.0,i20,Petrol,Pune,9/3/2025,628214,50.0,NaN
39,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
58,40055.0,100054.0,Baleno,CNG,Hyderabad,6/1/2025,1610932,12.0,NaN
9997,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
cs2025 = cs2025.drop_duplicates()

In [36]:
cs2025[cs2025.duplicated()]

Empty DataFrame
Columns: [Sale ID, Customer ID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID, abc]
Index: []

In [37]:
cs2025.isna().sum()

Sale ID              1
Customer ID          2
CarModel             2
FuelType             2
City                 2
SaleDate             4
Price                2
SalesPersonID        2
abc              10001
dtype: int64

In [38]:
cs2025.loc[cs2025['Price'].isna()]

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9989,49986.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
cs2025 = cs2025.drop(cs2025.index[22])

In [40]:
cs2025.loc[cs2025['Price'].isna()]

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9989,49986.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
cs2025.loc[22]

Sale ID          NaN
Customer ID      NaN
CarModel         NaN
FuelType         NaN
City             NaN
SaleDate         NaN
Price            NaN
SalesPersonID    NaN
abc              NaN
Name: 22, dtype: object

In [42]:
cs2025 = cs2025.drop(index=22)

In [43]:
cs2025.loc[cs2025['Price'].isna()]

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,abc
9989,49986.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
cs2025 = cs2025.dropna(subset=['Price'])

In [45]:
cs2025.loc[cs2025['Price'].isna()]

Empty DataFrame
Columns: [Sale ID, Customer ID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID, abc]
Index: []

In [46]:
cs2025 = cs2025.drop(['abc'], axis=1)

In [47]:
cs2025.head()

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
0,40001.0,100000.0,Creta,Diesel,Bangalore,4/28/2025,1578732,25.0
1,40002.0,100001.0,i20,Diesel,Delhi,9/19/2025,1246909,5.0
2,40003.0,100002.0,Baleno,Electric,Pune,5/28/2025,1490661,12.0
3,40004.0,100003.0,Verna,Petrol,Hyderabad,9/5/2025,"$887,475",20.0
4,40005.0,100004.0,City,Electric,Bangalore,9/6/2025,"$1,595,008",16.0

In [48]:
cs2025.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9998 entries, 0 to 10004
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sale ID        9998 non-null   float64
 1   Customer ID    9998 non-null   float64
 2   CarModel       9998 non-null   object
 3   FuelType       9998 non-null   object
 4   City           9998 non-null   object
 5   SaleDate       9996 non-null   object
 6   Price          9998 non-null   object
 7   SalesPersonID  9998 non-null   float64
dtypes: float64(3), object(5)
memory usage: 703.0+ KB

In [49]:
cs2025.isna().sum()

Sale ID          0
Customer ID      0
CarModel         0
FuelType         0
City             0
SaleDate         2
Price            0
SalesPersonID    0
dtype: int64

In [50]:
cs2025.loc[cs2025['SaleDate'].isna()]

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
9,40011.0,100010.0,City,Electric,Chennai,NaN,"$1,282,052",2.0
10,40012.0,100011.0,Venue,CNG,Chennai,NaN,"$1,458,981",16.0

In [51]:
cs2025['SaleDate'] = cs2025['SaleDate'].bfill()

In [52]:
cs2025.loc[cs2025['SaleDate'].isna()]

Empty DataFrame
Columns: [Sale ID, Customer ID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID]
Index: []

In [53]:
cs2025.isna().sum()

Sale ID          0
Customer ID      0
CarModel         0
FuelType         0
City             0
SaleDate         0
Price            0
SalesPersonID    0
dtype: int64

In [54]:
cs2025.head()

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
0,40001.0,100000.0,Creta,Diesel,Bangalore,4/28/2025,1578732,25.0
1,40002.0,100001.0,i20,Diesel,Delhi,9/19/2025,1246909,5.0
2,40003.0,100002.0,Baleno,Electric,Pune,5/28/2025,1490661,12.0
3,40004.0,100003.0,Verna,Petrol,Hyderabad,9/5/2025,"$887,475",20.0
4,40005.0,100004.0,City,Electric,Bangalore,9/6/2025,"$1,595,008",16.0

In [55]:
cs2025['Price'] = (
    cs2025['Price'].astype(str).str.replace(r'[$, ]', '', regex=True).astype(int)
)

In [56]:
cs2025.head()

,Sale ID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID
0,40001.0,100000.0,Creta,Diesel,Bangalore,4/28/2025,1578732,25.0
1,40002.0,100001.0,i20,Diesel,Delhi,9/19/2025,1246909,5.0
2,40003.0,100002.0,Baleno,Electric,Pune,5/28/2025,1490661,12.0
3,40004.0,100003.0,Verna,Petrol,Hyderabad,9/5/2025,887475,20.0
4,40005.0,100004.0,City,Electric,Bangalore,9/6/2025,1595008,16.0

In [57]:
cs2025.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9998 entries, 0 to 10004
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sale ID        9998 non-null   float64
 1   Customer ID    9998 non-null   float64
 2   CarModel       9998 non-null   object
 3   FuelType       9998 non-null   object
 4   City           9998 non-null   object
 5   SaleDate       9998 non-null   object
 6   Price          9998 non-null   int64
 7   SalesPersonID  9998 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 703.0+ KB

In [58]:
cs2025['Sale ID'] = cs2025['Sale ID'].astype(object)
cs2025['Customer ID'] = cs2025['Customer ID'].astype(object)
cs2025['SaleDate'] = pd.to_datetime(cs2025['SaleDate'])
cs2025['SalesPersonID'] = cs2025['SalesPersonID'].astype(object)

In [59]:
cs2025.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9998 entries, 0 to 10004
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sale ID        9998 non-null   object
 1   Customer ID    9998 non-null   object
 2   CarModel       9998 non-null   object
 3   FuelType       9998 non-null   object
 4   City           9998 non-null   object
 5   SaleDate       9998 non-null   datetime64[ns]
 6   Price          9998 non-null   int64
 7   SalesPersonID  9998 non-null   object
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 703.0+ KB

In [60]:
cs2025['Year'] = cs2025['SaleDate'].dt.strftime('%Y')

In [61]:
cs2025 = cs2025.rename(columns={'Sale ID':'SaleID'})

In [62]:
cs2025.head()

,SaleID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year
0,40001.0,100000.0,Creta,Diesel,Bangalore,2025-04-28,1578732,25.0,2025
1,40002.0,100001.0,i20,Diesel,Delhi,2025-09-19,1246909,5.0,2025
2,40003.0,100002.0,Baleno,Electric,Pune,2025-05-28,1490661,12.0,2025
3,40004.0,100003.0,Verna,Petrol,Hyderabad,2025-09-05,887475,20.0,2025
4,40005.0,100004.0,City,Electric,Bangalore,2025-09-06,1595008,16.0,2025

In [63]:
cs2025['SaleID'] = cs2025['SaleID'].astype(int)
cs2025['SaleID'] = cs2025['SaleID'].astype(object)

In [64]:
cs2025.head()

,SaleID,Customer ID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year
0,40001,100000.0,Creta,Diesel,Bangalore,2025-04-28,1578732,25.0,2025
1,40002,100001.0,i20,Diesel,Delhi,2025-09-19,1246909,5.0,2025
2,40003,100002.0,Baleno,Electric,Pune,2025-05-28,1490661,12.0,2025
3,40004,100003.0,Verna,Petrol,Hyderabad,2025-09-05,887475,20.0,2025
4,40005,100004.0,City,Electric,Bangalore,2025-09-06,1595008,16.0,2025

In [65]:
cs2025 = cs2025.rename(columns={'Customer ID':'CustomerID'})

In [66]:
cs2025.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year
0,40001,100000.0,Creta,Diesel,Bangalore,2025-04-28,1578732,25.0,2025
1,40002,100001.0,i20,Diesel,Delhi,2025-09-19,1246909,5.0,2025
2,40003,100002.0,Baleno,Electric,Pune,2025-05-28,1490661,12.0,2025
3,40004,100003.0,Verna,Petrol,Hyderabad,2025-09-05,887475,20.0,2025
4,40005,100004.0,City,Electric,Bangalore,2025-09-06,1595008,16.0,2025

In [67]:
cs2025['CustomerID'] = cs2025['CustomerID'].astype(int)
cs2025['CustomerID'] = cs2025['CustomerID'].astype(object)
cs2025['SalesPersonID'] = cs2025['SalesPersonID'].astype(int)
cs2025['SalesPersonID'] = cs2025['SalesPersonID'].astype(object)

In [68]:
cs2025.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year
0,40001,100000,Creta,Diesel,Bangalore,2025-04-28,1578732,25,2025
1,40002,100001,i20,Diesel,Delhi,2025-09-19,1246909,5,2025
2,40003,100002,Baleno,Electric,Pune,2025-05-28,1490661,12,2025
3,40004,100003,Verna,Petrol,Hyderabad,2025-09-05,887475,20,2025
4,40005,100004,City,Electric,Bangalore,2025-09-06,1595008,16,2025

In [69]:
cs2023.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [70]:
cs2024.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,i20,Electric,Hyderabad,2024-09-04,881926,50,2024
1,20002,100001,Swift,Electric,Chennai,2024-03-19,1763364,15,2024
2,20003,100002,Verna,Diesel,Hyderabad,2024-11-01,859163,10,2024
3,20004,100003,City,CNG,Bangalore,2024-02-05,1578002,21,2024
4,20005,100004,i20,Petrol,Hyderabad,2024-12-14,836295,28,2024

In [71]:
cardata_2023 = cs2023
cardata_2024 = cs2024
cardata_2025 = cs2025

In [72]:
# ===================================================================================================

In [73]:
car_showroom_data = pd.concat([cardata_2023, cardata_2024, cardata_2025], axis=0, ignore_index=True)

In [74]:
car_showroom_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29998 entries, 0 to 29997
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         29998 non-null  object
 1   CustomerID     29998 non-null  object
 2   CarModel       29998 non-null  object
 3   FuelType       29998 non-null  object
 4   City           29998 non-null  object
 5   SaleDate       29998 non-null  datetime64[ns]
 6   Price          29998 non-null  int64
 7   SalesPersonID  29998 non-null  object
 8   Year           19998 non-null  object
 9   SaleYear       10000 non-null  object
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 2.3+ MB

In [75]:
car_showroom_data.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023,NaN
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023,NaN
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023,NaN
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023,NaN
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023,NaN

In [76]:
car_showroom_data.isna().sum()

SaleID               0
CustomerID           0
CarModel             0
FuelType             0
City                 0
SaleDate             0
Price                0
SalesPersonID        0
Year             10000
SaleYear         19998
dtype: int64

In [77]:
car_showroom_data = car_showroom_data.drop(['SaleYear'], axis=1)

In [78]:
car_showroom_data.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,Year
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [79]:
car_showroom_data.isna().sum()

SaleID               0
CustomerID           0
CarModel             0
FuelType             0
City                 0
SaleDate             0
Price                0
SalesPersonID        0
Year             10000
dtype: int64

In [80]:
car_showroom_data = car_showroom_data.drop(['Year'], axis=1)

In [81]:
car_showroom_data['SaleYear'] = car_showroom_data['SaleDate'].dt.strftime('%Y')

In [82]:
car_showroom_data.isna().sum()

SaleID           0
CustomerID       0
CarModel         0
FuelType         0
City             0
SaleDate         0
Price            0
SalesPersonID    0
SaleYear         0
dtype: int64

In [83]:
car_showroom_data[car_showroom_data.duplicated()]

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
20018,40019,100018,Creta,Electric,Chennai,2025-03-15,682953,30,2025

In [84]:
car_showroom_data = car_showroom_data.drop_duplicates()

In [85]:
car_showroom_data[car_showroom_data.duplicated()]

Empty DataFrame
Columns: [SaleID, CustomerID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID, SaleYear]
Index: []

In [86]:
car_showroom_data.isna().sum()

SaleID           0
CustomerID       0
CarModel         0
FuelType         0
City             0
SaleDate         0
Price            0
SalesPersonID    0
SaleYear         0
dtype: int64

In [87]:
car_showroom_data.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [88]:
car_showroom_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29997 entries, 0 to 29997
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         29997 non-null  object
 1   CustomerID     29997 non-null  object
 2   CarModel       29997 non-null  object
 3   FuelType       29997 non-null  object
 4   City           29997 non-null  object
 5   SaleDate       29997 non-null  datetime64[ns]
 6   Price          29997 non-null  int64
 7   SalesPersonID  29997 non-null  object
 8   SaleYear       29997 non-null  object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 2.3+ MB

In [89]:
car_showroom_data.describe()

                            SaleDate         Price
count                          29997  2.999700e+04
mean   2024-07-01 19:46:46.480648192  1.151213e+06
min              2023-01-01 00:00:00  0.000000e+00
25%              2023-09-30 00:00:00  8.290460e+05
50%              2024-07-03 00:00:00  1.152118e+06
75%              2025-04-03 00:00:00  1.476211e+06
max              2025-12-31 00:00:00  1.799971e+06
std                              NaN  3.740822e+05

In [90]:
car_showroom_data.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [91]:
car_showroom_data.iloc[0:10]

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023
5,20006,100005,i20,Electric,Hyderabad,2023-07-15,560902,34,2023
6,20007,100006,XUV300,Electric,Chennai,2023-04-24,988813,23,2023
7,20008,100007,i20,Electric,Delhi,2023-04-29,545067,27,2023
8,20009,100008,Baleno,Diesel,Hyderabad,2023-10-12,1121575,8,2023
9,20010,100009,Verna,Diesel,Delhi,2023-06-20,1095925,38,2023

In [92]:
car_showroom_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29997 entries, 0 to 29997
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         29997 non-null  object
 1   CustomerID     29997 non-null  object
 2   CarModel       29997 non-null  object
 3   FuelType       29997 non-null  object
 4   City           29997 non-null  object
 5   SaleDate       29997 non-null  datetime64[ns]
 6   Price          29997 non-null  int64
 7   SalesPersonID  29997 non-null  object
 8   SaleYear       29997 non-null  object
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 2.3+ MB

In [93]:
car_showroom_data.loc[car_showroom_data.isna().any(axis=1)]

Empty DataFrame
Columns: [SaleID, CustomerID, CarModel, FuelType, City, SaleDate, Price, SalesPersonID, SaleYear]
Index: []

In [94]:
car_showroom_data.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [95]:
Groupby = car_showroom_data.groupby('City')['City'].count()

In [112]:
Groupby

City
Bangalore    5021
Chennai      5039
Delhi        4872
Hyderabad    4955
Mumbai       5072
Pune         5038
Name: City, dtype: int64

In [119]:
car_showroom_data.to_csv('car_showroom_data1.csv') # this saves csv with index

In [118]:
car_showroom_data.to_csv('car_showroom_data.csv', index=False) # this remove the index number and save file as csv

In [114]:
grp = Groupby.reset_index(name='count')

In [115]:
grp

        City  count
0  Bangalore   5021
1    Chennai   5039
2      Delhi   4872
3  Hyderabad   4955
4     Mumbai   5072
5       Pune   5038

In [122]:
grp = grp.reset_index(drop=True)

In [123]:
grp

        City  count
0  Bangalore   5021
1    Chennai   5039
2      Delhi   4872
3  Hyderabad   4955
4     Mumbai   5072
5       Pune   5038

In [124]:
# ============================================================================================================

In [131]:
df = pd.read_csv('car_showroom_data.csv')

In [132]:
df.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [134]:
df.describe(include="all")

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
count,29997.000000,29997.000000,29997,29997,29997,29997,2.999700e+04,29997.000000,29997.00000
unique,NaN,NaN,8,4,6,1095,NaN,NaN,NaN
top,NaN,NaN,Verna,Diesel,Mumbai,2024-10-23,NaN,NaN,NaN
freq,NaN,NaN,3835,7622,5072,45,NaN,NaN,NaN
mean,31665.999333,104999.666133,NaN,NaN,NaN,NaN,1.151213e+06,25.483448,2023.99990
std,9859.987348,2886.513345,NaN,NaN,NaN,NaN,3.740822e+05,14.390112,0.81649
min,20001.000000,100000.000000,NaN,NaN,NaN,NaN,0.000000e+00,1.000000,2023.00000
25%,23750.000000,102500.000000,NaN,NaN,NaN,NaN,8.290460e+05,13.000000,2023.00000
50%,27500.000000,105000.000000,NaN,NaN,NaN,NaN,1.152118e+06,26.000000,2024.00000
75%,42500.000000,107499.000000,NaN,NaN,NaN,NaN,1.476211e+06,38.000000,2025.00000
max,50000.000000,109999.000000,NaN,NaN,NaN,NaN,1.799971e+06,50.000000,2025.00000

In [137]:
# ======================
# Data Analysis

In [138]:
df.head()

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
0,20001,100000,Baleno,CNG,Mumbai,2023-03-10,1539002,49,2023
1,20002,100001,XUV300,Electric,Pune,2023-08-19,696837,32,2023
2,20003,100002,Verna,Electric,Chennai,2023-01-15,504416,45,2023
3,20004,100003,Venue,Diesel,Chennai,2023-08-17,714385,21,2023
4,20005,100004,Swift,Petrol,Hyderabad,2023-01-16,1635424,1,2023

In [139]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29997 entries, 0 to 29996
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         29997 non-null  int64
 1   CustomerID     29997 non-null  int64
 2   CarModel       29997 non-null  object
 3   FuelType       29997 non-null  object
 4   City           29997 non-null  object
 5   SaleDate       29997 non-null  object
 6   Price          29997 non-null  int64
 7   SalesPersonID  29997 non-null  int64
 8   SaleYear       29997 non-null  int64
dtypes: int64(5), object(4)
memory usage: 2.1+ MB

In [140]:
# Analysis 1 - Total Sales & Revenue - Overall business performance
total_sales = df.shape[0]
total_revenue = df['Price'].sum()
avg_price = df['Price'].mean()

In [141]:
total_sales

29997

In [144]:
print(f'Total_Car_Sold is: {total_sales}')
print(f'Total_Revenue_Generated is: {total_revenue}')
print(f'Average_Selling_Price is: {avg_price}')

Total_Car_Sold is: 29997
Total_Revenue_Generated is: 34532928162
Average_Selling_Price is: 1151212.7266726673

In [146]:
# Analysis 2 - City-wise Sales Count - Which cities perform best
sales_by_city = (
    df.groupby('City').size().reset_index(name='Sales_Count').sort_values(by='Sales_Count', ascending=False)
)

In [147]:
sales_by_city

        City  Sales_Count
4     Mumbai         5072
1    Chennai         5039
5       Pune         5038
0  Bangalore         5021
3  Hyderabad         4955
2      Delhi         4872

In [150]:
# Analysis 3 - City-wise Revenue - High volume  high revenue
city_revenue = (
    df.groupby('City')['Price'].sum().reset_index(name='Total_Revenue').sort_values(by='Total_Revenue', ascending=False)
)

In [151]:
city_revenue

        City  Total_Revenue
4     Mumbai     5904224068
1    Chennai     5810143045
0  Bangalore     5793491796
5       Pune     5745690427
3  Hyderabad     5702474484
2      Delhi     5576904342

In [152]:
# Analysis 4 - Average price by city - Customer purchasing power
avg_price_city = (
    df.groupby('City')['Price'].mean().reset_index(name='Average_Price').sort_values(by='Average_Price', ascending=False)
)

In [153]:
avg_price_city

        City  Average_Price
4     Mumbai   1.164082e+06
0  Bangalore   1.153852e+06
1    Chennai   1.153035e+06
3  Hyderabad   1.150853e+06
2      Delhi   1.144685e+06
5       Pune   1.140471e+06

In [154]:
# Analysis 5 - Most Sold Car Models - Product demand analysis
model_sales = (
    df.groupby('CarModel').size().reset_index(name='Units_Sold').sort_values(by='Units_Sold', ascending=False)
)

In [155]:
model_sales

  CarModel  Units_Sold
5    Verna        3835
0   Baleno        3791
3    Swift        3789
1     City        3775
4    Venue        3753
7      i20        3711
6   XUV300        3700
2    Creta        3643

In [158]:
# Analysis 6 - Revenue by Car Model - Which model earns most money
model_revenue = (
    df.groupby('CarModel')['Price'].sum().reset_index(name='Total_Revenue').sort_values(by='Total_Revenue', ascending=False)
)

In [159]:
model_revenue

  CarModel  Total_Revenue
5    Verna     4391814144
0   Baleno     4378877390
3    Swift     4369732872
4    Venue     4332008566
1     City     4301853527
6   XUV300     4291043073
7      i20     4256673845
2    Creta     4210924745

In [162]:
# Analysis 7 - Fuel Type Distribution - Market trend detection
fuel_dist = (
    df['FuelType'].value_counts().reset_index().rename(columns={'index':'FuelType', 'FuelType':'Count'})
)

In [163]:
fuel_dist

      Count  count
0    Diesel   7622
1    Petrol   7534
2  Electric   7443
3       CNG   7398

In [164]:
# Analysis 8 - Fuel Type  Revenue - Which fuel earns more
fuel_revenue = (
    df.groupby('FuelType')['Price'].sum().reset_index(name='Revenue').sort_values(by='Revenue', ascending=False)
)

In [165]:
fuel_revenue

   FuelType     Revenue
1    Diesel  8781476877
3    Petrol  8670924945
2  Electric  8590440585
0       CNG  8490085755

In [167]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29997 entries, 0 to 29996
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   SaleID         29997 non-null  int64
 1   CustomerID     29997 non-null  int64
 2   CarModel       29997 non-null  object
 3   FuelType       29997 non-null  object
 4   City           29997 non-null  object
 5   SaleDate       29997 non-null  object
 6   Price          29997 non-null  int64
 7   SalesPersonID  29997 non-null  int64
 8   SaleYear       29997 non-null  int64
dtypes: int64(5), object(4)
memory usage: 2.1+ MB

In [168]:
df['SaleDate'] = pd.to_datetime(df['SaleDate'])
df['SaleDate'] = df['SaleDate'].astype(object)

In [171]:
# Analysis 9 - Year-wise / Date-wise Sales Trend - Time series insight
yearly_sales = (
    df.groupby('SaleYear').size().reset_index(name='Sales')
)

In [172]:
yearly_sales

   SaleYear  Sales
0      2023  10000
1      2024  10000
2      2025   9997

In [174]:
# Analysis 10 - Salesperson Performance -  Employee productivity

In [178]:
salesperson_perf = (
    df.groupby("SalesPersonID")
      .agg(
          Cars_Sold=("Price", "count"),
          Revenue=("Price", "sum")
      )
      .reset_index()
      .sort_values(by="Revenue", ascending=False).head(10)
)

In [179]:
salesperson_perf

    SalesPersonID  Cars_Sold    Revenue
29             30        636  740253730
30             31        639  738923382
26             27        640  736439003
23             24        642  732592006
39             40        638  726410576
12             13        634  724876143
43             44        629  721293780
37             38        616  720515695
31             32        617  719316489
36             37        623  715819213

In [190]:
# Analysis 11 - Customer-Level Analysis - Customer value
Customer_value = (
    df.groupby('CustomerID')['Price'].agg(['count','sum']).reset_index()
    .rename(columns={'count':'Cars_Bought','sum':'Total_Spend'})
)
Customer_value = Customer_value.sort_values(by='Total_Spend', ascending=False).head(10)

In [192]:
Customer_value

      CustomerID  Cars_Bought  Total_Spend
5955      105955            3      5234850
6796      106796            3      5228418
3090      103090            3      5227369
3353      103353            3      5217303
2906      102906            3      5212795
7805      107805            3      5212268
3860      103860            3      5211259
9424      109424            3      5187620
4588      104588            3      5182494
1799      101799            3      5180177

In [193]:
# Analysis 12 - Cross Analysis (City  Fuel Type) - Advanced business insight
city_fuel = pd.crosstab(df['City'], df['FuelType'])

In [194]:
city_fuel

FuelType    CNG  Diesel  Electric  Petrol
City
Bangalore  1261    1282      1187    1291
Chennai    1236    1297      1227    1279
Delhi      1204    1191      1251    1226
Hyderabad  1307    1234      1214    1200
Mumbai     1207    1317      1268    1280
Pune       1183    1301      1296    1258

In [195]:
df['Price'].describe()

count    2.999700e+04
mean     1.151213e+06
std      3.740822e+05
min      0.000000e+00
25%      8.290460e+05
50%      1.152118e+06
75%      1.476211e+06
max      1.799971e+06
Name: Price, dtype: float64

In [196]:
df[df['Price'] > df['Price'].quantile(0.95)]

,SaleID,CustomerID,CarModel,FuelType,City,SaleDate,Price,SalesPersonID,SaleYear
20,20021,100020,Swift,CNG,Bangalore,2023-06-27 00:00:00,1757987,2,2023
47,20048,100047,Creta,CNG,Mumbai,2023-03-17 00:00:00,1790138,38,2023
92,20093,100092,Swift,Petrol,Hyderabad,2023-10-24 00:00:00,1770093,16,2023
102,20103,100102,Swift,CNG,Hyderabad,2023-04-15 00:00:00,1754441,47,2023
108,20109,100108,Venue,Diesel,Mumbai,2023-07-23 00:00:00,1769746,1,2023
...,...,...,...,...,...,...,...,...,...
29852,49855,109854,Verna,Diesel,Hyderabad,2025-09-10 00:00:00,1744537,46,2025
29898,49901,109900,i20,Diesel,Chennai,2025-06-13 00:00:00,1797455,17,2025
29905,49908,109907,XUV300,Petrol,Hyderabad,2025-03-02 00:00:00,1780439,23,2025
29969,49972,109971,XUV300,Electric,Chennai,2025-10-25 00:00:00,1743518,18,2025
29982,49985,109984,i20,CNG,Chennai,2025-02-14 00:00:00,1789094,26,2025